lkolbly/cmsis-svd/data/TexasInstruments/LM4F122H5QD.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER1</name>
      <prependToName>TIMER1</prependToName>
      <baseAddress>0x40031000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER2</name>
      <prependToName>TIMER2</prependToName>
      <baseAddress>0x40032000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER3</name>
      <prependToName>TIMER3</prependToName>
      <baseAddress>0x40033000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER4</name>
      <prependToName>TIMER4</prependToName>
      <baseAddress>0x40034000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER5</name>
      <prependToName>TIMER5</prependToName>
      <baseAddress>0x40035000</baseAddress>
    </peripheral>
    <peripheral>
      <name>WTIMER0</name>
      <description>Register map for WTIMER0 peripheral</description>
      <groupName>TIMER</groupName>
      <prependToName>WTIMER0</prependToName>
      <baseAddress>0x40036000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <description>GPTM Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>TIMER_CFG</name>
              <description>GPTM Configuration</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_TIMER</name>
                  <description>32-bit timer configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_RTC</name>
                  <description>32-bit real-time clock (RTC) counter configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_16_BIT</name>
                  <description>16-bit timer configuration. The function is controlled by bits 1:0 of GPTMTAMR and GPTMTBMR</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMR</name>
          <description>GPTM Timer A Mode</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAMR_TAMR</name>
              <description>GPTM Timer A Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_CAP</name>
                  <description>Capture mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_TAMR_TACMR</name>
              <description>GPTM Timer A Capture Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAAMS</name>
              <description>GPTM Timer A Alternate Mode Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TACDIR</name>
              <description>GPTM Timer A Count Direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAMIE</name>
              <description>GPTM Timer A Match Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAWOT</name>
              <description>GPTM Timer A Wait-on-Trigger</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TASNAPS</name>
              <description>GPTM Timer A Snap-Shot Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAILD</name>
              <description>GPTM Timer A Interval Load Write</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAPWMIE</name>
              <description>GPTM Timer A PWM Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAMRSU</name>
              <description>GPTM Timer A Match Register Update</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_TAMR_TAPLO</name>
              <description>GPTM Timer A PWM Legacy Operation</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBMR</name>
          <description>GPTM Timer B Mode</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBMR_TBMR</name>
              <description>GPTM Timer B Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_CAP</name>
                  <description>Capture mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_TBMR_TBCMR</name>
              <description>GPTM Timer B Capture Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBAMS</name>
              <description>GPTM Timer B Alternate Mode Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBCDIR</name>
              <description>GPTM Timer B Count Direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBMIE</name>
              <description>GPTM Timer B Match Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBWOT</name>
              <description>GPTM Timer B Wait-on-Trigger</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBSNAPS</name>
              <description>GPTM Timer B Snap-Shot Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBILD</name>
              <description>GPTM Timer B Interval Load Write</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBPWMIE</name>
              <description>GPTM Timer B PWM Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBMRSU</name>
              <description>GPTM Timer B Match Register Update</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_TBMR_TBPLO</name>
              <description>GPTM Timer B PWM Legacy Operation</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>GPTM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>TIMER_CTL_TAEN</name>
              <description>GPTM Timer A Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TASTALL</name>
              <description>GPTM Timer A Stall Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAEVENT</name>
              <description>GPTM Timer A Event Mode</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TAEVENT_BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_CTL_RTCEN</name>
              <description>GPTM RTC Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAOTE</name>
              <description>GPTM Timer A Output Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAPWML</name>
              <description>GPTM Timer A PWM Output Level</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBEN</name>
              <description>GPTM Timer B Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBSTALL</name>
              <description>GPTM Timer B Stall Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBEVENT</name>
              <description>GPTM Timer B Event Mode</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CTL_TBEVENT_BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_CTL_TBOTE</name>
              <description>GPTM Timer B Output Trigger Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBPWML</name>
              <description>GPTM Timer B PWM Output Level</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
